[
  {
    "title": "Music Player",
    "image": "./projectImages/player.png",
    "description": "Exceptional Features\n⭕ Embraces all essential functions of a top-tier music player\n🍏 Secure the MP3 tracks you love along with their detailed metadata\n🏠 Embodying a sleek and contemporary design\n📱 Streamlined interface for seamless mobile navigation\n♻ Absolutely ad-free, completely open-source, and meticulously optimized code\n🎵 Dive into an extensive treasure trove of songs, fetched directly for your pleasure",
    "technologies": ["Bootstrap", "HTML", "CSS","Typescript","Javascript"],
    "github": "https://github.com/mdyeates/bike-buddy",
    "deployed": "https://eric-music-player-ten.vercel.app/#Ed%20Sheeran",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  },
  {
    "title": "Weather",
    "image": "./projectImages/weather.png",
    "technologies": ["JavaScript", "jQuery", "HTML", "CSS"],
    "description": "Hello! I've developed a mobile app that's designed to be super smooth and visually appealing on any type of mobile screen. The special ingredient that makes it all work is the OpenWeatherMap API. This API provides all the information you need about the weather: city name, date, charming weather icons, temperature, humidity, and even wind speed. But wait, there's even more to it! ☀️\nYou can take a look at the 5-day forecast, which is like having a crystal ball for weather enthusiasts. And don't worry, I've got a feature that remembers your search history, so you don't have to type in the same details again.\nAnd here's an awesome feature: the app's interface switches between a dark and light theme depending on whether it's daytime (sunbathing time) or nighttime (stargazing time) in the city you're checking the weather for. Plus, it works like magic – it detects your location and provides you with the weather information, so no more wondering if it's raining outside!",
    "github": "https://github.com/mdyeates/weather-app",
    "deployed": "https://eric-weather-bice-eight.vercel.app",
    "bgcolor": "var(--hl-color)",
    "id": "2"
  },
  {
    "title": "Planner",
    "image": "./projectImages/planner.png",
    "technologies": ["JavaScript", "Moment", "Bootstrap", "HTML", "CSS"],
    "description": "Introducing the Daily Planner App – Your Ultimate Day Organizer\nElevate your productivity and seize each moment with the Daily Planner App – your reliable companion in maximizing every minute. Bid farewell to those memory lapses concerning crucial appointments and meetings. This app stands as your dependable aide, offering a streamlined and effective method to manage your schedule, particularly during those intense 9-to-5 stretches!\nAnd hold on tight, because the magic doesn't stop there. This ingenious app understands the significance of ambiance – it adapts its colors to correspond with the time of day. Now that's what you call setting the perfect atmosphere! But wait, there's more – your to-dos? They're here to stay, securely stored and readily accessible whenever you require them. It's time to conquer your day like a true champion! 📝 ✅",
    "github": "https://github.com/mdyeates/daily-planner",
    "deployed": "https://eric-planner-work-red.vercel.app",
    "bgcolor": "#3e67ff",
    "id": "6"
  },
  {
    "title": "ChatBot",
    "image": "./projectImages/chatbot.png",
    "technologies": ["Php", "HTML", "CSS","Mysql"],
    "description": "The Cloud-Based Student Information Chatbot System is a web application powered by AI that understands and responds to student queries about college activities. It accepts queries in various formats, uses AI for accurate responses, and allows users to flag incorrect answers. Admins can review and edit flagged responses. The system offers a user-friendly interface that mimics human interaction. It's deployed on a cloud platform like AWS or GCP for easy access and scalability.",
    "github": "https://github.com/mdyeates/coding-quiz",
    "deployed": "https://edgier-basis.000webhostapp.com/index.php",
    "bgcolor": "#f85781",
    "id": "4"
  }
]
