[
    {
    "title": "Movie",
    "image": "./projectImages/movie.png",
    "technologies": ["JavaScript", "React", "Bootstrap", "HTML", "CSS"],
    "description": "",
    "deployed": "https://movie-app-imdb-4krd7efle-nad0640.vercel.app/#/",
    "bgcolor": "#3e67ff",
    "id": "6"
  },
  {
    "title": "Exercise",
    "image": "./projectImages/exercise.png",
    "technologies": ["JavaScript", "React", "Bootstrap", "HTML", "CSS"],
    "description": "",
    "deployed": "https://exercise-two.vercel.app/",
    "bgcolor": "#f85781",
    "id": "4"
  },
    {
    "title": "Router",
    "image": "./projectImages/Router.png",
    "technologies": ["React ", "Bootstrap", "Vite","HTML", "CSS"],
    "description": "I utilized Leaflet.js and Geolocation APIs to build an interactive, visually appealing map. You can easily plan routes, taking factors like traffic, bike lanes, and hill steepness into account. It's like planning a kid-friendly adventure!",
      "deployed": "https://map-hk.netlify.app/",
    "bgcolor": "#6c4bf4",
    "id": "3"
  },
    {
    "title": "Health",
    "image": "./projectImages/Health.png",
    "description": "Amidst life's chaos, when emotions like depression weigh heavily, we crafted a Mental Health web app. Our inspiration was to offer motivation through uplifting quotes and ease stress. Additionally, we aimed to broaden the availability of mental health resources and support.\n\nRecognizing the widespread prevalence of mental health issues, we saw the struggle many face in accessing vital resources. Our web app seeks to bridge this gap by providing self-help tools, educational materials, and a space for connecting with a supportive community. Our goal is to empower individuals who might find traditional services inaccessible or daunting.",
      "technologies": ["Bootstrap", "HTML", "CSS"],
    "deployed": "https://mental-health-project-sigma.vercel.app/",
    "bgcolor": "#ffcc33",
    "id": "1"
  },
  {
    "title": "Weather",
    "image": "./projectImages/weather.png",
    "technologies": ["JavaScript", "jQuery", "HTML", "CSS"],
    "description": "Hello! I've developed a mobile app that's designed to be super smooth and visually appealing on any type of mobile screen. The special ingredient that makes it all work is the OpenWeatherMap API. This API provides all the information you need about the weather: city name, date, charming weather icons, temperature, humidity, and even wind speed. But wait, there's even more to it! ☀️\nYou can take a look at the 5-day forecast, which is like having a crystal ball for weather enthusiasts. And don't worry, I've got a feature that remembers your search history, so you don't have to type in the same details again.\nAnd here's an awesome feature: the app's interface switches between a dark and light theme depending on whether it's daytime (sunbathing time) or nighttime (stargazing time) in the city you're checking the weather for. Plus, it works like magic – it detects your location and provides you with the weather information, so no more wondering if it's raining outside!",
    "deployed": "https://eric-weather-bice-eight.vercel.app",
    "bgcolor": "var(--hl-color)",
    "id": "2"
  },

    {
    "title": "Music Player",
    "image": "./projectImages/player.png",
    "description": "Exceptional Features\n⭕ Embraces all essential functions of a top-tier music player\n🍏 Secure the MP3 tracks you love along with their detailed metadata\n🏠 Embodying a sleek and contemporary design\n📱 Streamlined interface for seamless mobile navigation\n♻ Absolutely ad-free, completely open-source, and meticulously optimized code\n🎵 Dive into an extensive treasure trove of songs, fetched directly for your pleasure",
    "technologies": ["Bootstrap", "HTML", "CSS","Typescript","Javascript"],
    "deployed": "https://eric-music-player-ten.vercel.app/#Ed%20Sheeran",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  }
]
